recipes/L11_wallResolved_WT/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
// ARGUS full domain.  Sized on the Onera M6 OpenFOAM tutorial precedent, which
// puts the far field 15.05 semispans out in every direction and reports
// excellent agreement with experiment.
//
//   ARGUS semispan 1.8288 m,  30 m = 16.4 semispans.
//   Wolf Dynamics minimum (5L / 15L / 5L on root chord) would be only
//   1.75 semispans laterally, which is far too tight for a lifting wing.
//
// Base cell 1.0 m, uniform, so surface level 8 gives 3.906 mm, IDENTICAL
// physical surface resolution to the sandbox.
// Background cells 60 x 30 x 60 = 108 000.

convertToMeters 1;

xMin -30; xMax 30;
yMin   0; yMax 30;
zMin -30; zMax 30;

vertices
(
    ($xMin $yMin $zMin) ($xMax $yMin $zMin) ($xMax $yMax $zMin) ($xMin $yMax $zMin)
    ($xMin $yMin $zMax) ($xMax $yMin $zMax) ($xMax $yMax $zMax) ($xMin $yMax $zMax)
);

blocks ( hex (0 1 2 3 4 5 6 7) (60 30 60) simpleGrading (1 1 1) );

edges ();

boundary
(
    symmetry  { type symmetry; faces ( (0 1 5 4) ); }
    inlet     { type patch;    faces ( (0 4 7 3) ); }
    outlet    { type patch;    faces ( (1 2 6 5) ); }
    outboard  { type patch;    faces ( (3 7 6 2) ); }
    topBottom { type patch;    faces ( (4 5 6 7) (0 3 2 1) ); }
);

mergePatchPairs ();
